OpenFOAM files/run/streetcanyon_perpendicular/LoD3/LAD14/conifer/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    y1
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    y0
    {
        type            atmBoundaryLayerInletVelocity;
        #include        "include/ABLConditions"
    }

    wall
    {
        type            noSlip;
    }
    
    #include "include/sideAndTopPatches"
}


// ************************************************************************* //
